palette-swap-backend/app/controllers/palettes_controller.rb

SELECT "palettes".* FROM "palettes"
---
  def index
    palettes = Palette.all

INSERT INTO "palettes" ("name", "color1", "color2", "pattern_id") VALUES (?, ?, ?, ?)  [["name", "Nickelodeon"], ["color1", "76,221,226"], ["color2", "239,140,38"], ["pattern_id", 1]]
---
  def create
    palette = Palette.new(palette_params)

    if palette.save

UPDATE "palettes" SET "name" = ? WHERE "palettes"."id" = ?  [["name", "Wheat"], ["id", 2]]
---
  def update
    if @palette.update(palette_params)

DELETE FROM "palettes" WHERE "palettes"."id" = ?  [["id", 12]]
---
  def destroy
    @palette.destroy

SELECT  "palettes".* FROM "palettes" WHERE "palettes"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def set_palette
    @palette = Palette.find(params[:id])